Revit 2026 API

# WoodPoreType Enumeration

---

The enumerated type representing the permitted values for the asset property "WoodPoreType" from the "AdvancedLayered" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum WoodPoreType
```
```vb
Public Enumeration WoodPoreType
```
```cpp
public enum class WoodPoreType
```
```fsharp
type WoodPoreType
```

| Member name | Value | Description |
| --- | --- | --- |
| EarlywoodOnly | 1 |  |
| InBothWoods | 0 |  |
| LatewoodOnly | 2 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace